/*
 * Copyright (c) 2019 Tehuti Networks Ltd.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 */

#ifndef _TN40_HW_H_
#define _TN40_HW_H_

#include "tn40.h"
#include "tn40_ioctl.h"

#define TN40_DRV_NAME      			"tn40xx"
#define TN40_DRV_VERSION   			"1.2"

#       define CPU_CHIP_SWAP32(x) (x)
#       define CPU_CHIP_SWAP16(x) (x)
#else
#       define CPU_CHIP_SWAP32(x) (SwapBytes32(x))
#       define CPU_CHIP_SWAP16(x) (SwapBytes16 (x))
#endif

#define TEHUTI_VID  			0x1FC9
#define DLINK_VID  				0x1186
#define ASUS_VID				0x1043
#define EDIMAX_VID				0x1432
#define PROMISE_VID				0x105a
#define BUFFALO_VID				0x1154

#define MDIO_SPEED_1MHZ 		(1)
#define MDIO_SPEED_6MHZ			(6)
#define TN40_MAX_PAGE_SIZE     	(0x40000)

enum LOAD_FW
{
	NO_FW_LOAD=0,
	FW_LOAD,
};

/* Supported PHYs */

#define PHY_MV88X3310
#define PHY_MV88E2010
#define PHY_MV88X3120
#define PHY_TLK10232
#define PHY_AQR105
#define PHY_QT2025
struct bdx_priv;
int MV88X3310_set_speed(struct bdx_priv *priv, signed int speed);
int MV88X3120_set_speed(struct bdx_priv *priv, signed int speed);
int TLK10232_set_speed (struct bdx_priv *priv, signed int speed);
int AQR105_set_speed   (struct bdx_priv *priv, signed int speed);
int QT2025_set_speed   (struct bdx_priv *priv, signed int speed);

#define AUTONEG_DISABLE			(0)
#define AUTONEG_ENABLE			(1)

enum PHY_TYPE
{
    PHY_TYPE_NA,      		/* Port not exists or unknown PHY	*/
    PHY_TYPE_CX4,     		/* PHY works without initialization */
    PHY_TYPE_QT2025,  		/* QT2025 10 Gbps SFP+    			*/
    PHY_TYPE_MV88X3120,  	/* MV88X3120  10baseT  				*/
    PHY_TYPE_MV88X3310,  	/* MV88X3310  10baseT  				*/
    PHY_TYPE_MV88E2010,  	/* MV88E2010  5NbaseT  				*/
    PHY_TYPE_TLK10232,		/* TI TLK10232 SFP+					*/
	PHY_TYPE_AQR105,		/* AQR105 10baseT					*/
    PHY_TYPE_CNT
};

enum PHY_LEDS_OP
{
    PHY_LEDS_SAVE,
    PHY_LEDS_RESTORE,
    PHY_LEDS_ON,
    PHY_LEDS_OFF,
    PHY_LEDS_CNT
};

enum TX_STATE
{
	TX_STATE_OK,
	TX_STATE_QUEUE_FULL
};

/* Driver states */

#define	BDX_STATE_NONE		(0x00000000)
#define	BDX_STATE_HW_STOPPED (0x00000001)
#define BDX_STATE_STARTED	(0x00000002)
#define BDX_STATE_OPEN		(0x00000004)

#define BDX_NDEV_TXQ_LEN    3000
#define FIFO_SIZE       	4096
#define FIFO_EXTRA_SPACE    1024
#define BDX_MAX_RX_DONE    	150
#define BDX_TXF_DESC_SZ    	16
#define BDX_MAX_TX_LEVEL   	(priv->txd_fifo0.m.memsz - 16)
#define BDX_MIN_TX_LEVEL   	256
#define BDX_NO_UPD_PACKETS 	40
#define BDX_MAX_MTU		   	(1 << 14)

#define PCK_TH_MULT   		128
#define INT_COAL_MULT 		2

#define BITS_MASK(nbits)            		((1 << nbits)-1)
#define GET_BITS_SHIFT(x, nbits, nshift)    (((x) >> nshift)&BITS_MASK(nbits))
#define BITS_SHIFT_MASK(nbits, nshift)      (BITS_MASK(nbits) << nshift)
#define BITS_SHIFT_VAL(x, nbits, nshift)    (((x) & BITS_MASK(nbits)) << nshift)
#define BITS_SHIFT_CLEAR(x, nbits, nshift)  ((x)&(~BITS_SHIFT_MASK(nbits, nshift)))

#define GET_INT_COAL(x)             GET_BITS_SHIFT(x, 15,  0)
#define GET_INT_COAL_RC(x)          GET_BITS_SHIFT(x,  1, 15)
#define GET_RXF_TH(x)               GET_BITS_SHIFT(x,  4, 16)
#define GET_PCK_TH(x)               GET_BITS_SHIFT(x,  4, 20)

#define INT_REG_VAL(coal, coal_rc, rxf_th, pck_th)  \
    ((coal) | ((coal_rc) << 15) | ((rxf_th) << 16) | ((pck_th) << 20))

typedef struct
{
	void			*va;
	bus_addr_t		pa;
	bus_dmamap_t	dma_map;
}tn40_dmamap_t;

typedef struct
{
	bus_dma_tag_t	dma_tag;
	tn40_dmamap_t	tn40_dmamap;
}tn40_dma_t;


struct fifo
{
    dma_addr_t  da;     	/* Physical address of fifo (used by HW) */
    char        *va;    	/* Virtual address of fifo (used by SW) */
    u32     	rptr, wptr; /* Cached values of RPTR and WPTR registers,
                   	   	   	   they're 32 bits on both 32 and 64 archs */
    u16     	reg_CFG0, reg_CFG1;
    u16     	reg_RPTR, reg_WPTR;
    u16     	memsz;  	/* Memory size allocated for fifo */
    u16     	size_mask;
    u16     	pktsz;  	/* Skb packet size to allocate */
    u16     	rcvno;  	/* Number of buffers that come from this RXF */
    tn40_dma_t	dma;
};

struct txf_fifo
{
    struct fifo m;   /* The minimal set of variables used by all fifos  */
};

struct txd_fifo
{
    struct fifo m;   /* The minimal set of variables used by all fifos */
};

struct rxf_fifo
{
    struct fifo m;   /* The minimal set of variables used by all fifos */
};

struct rxd_fifo
{
    struct fifo m;   /* The minimal set of variables used by all fifos */
};

struct rx_map
{
	bus_dmamap_t	dma_map;
    struct mbuf 	*mBuf;
};

struct rxdb
{
    int     		*stack;
    struct rx_map   *elems;
    int     		nelem;
    int     		top;
    tn40_dma_t		pkt;
    int				rxfSize;
    int				rxfAvail;
};

struct tx_map
{
	bus_dmamap_t	dma_map;
	int64_t			len;
    struct mbuf 	*mBuf;
};

/* tx database - implemented as circular fifo buffer*/
struct txdb
{
    struct tx_map   *start; /* Points to the first element     */
    struct tx_map   *end;   /* Points just AFTER the last element  */
    struct tx_map   *rptr;  /* Points to the next element to read  */
    struct tx_map   *wptr;  /* Points to the next element to write */
    int     size;   /* Number of elements in the db    */
};

/*Internal stats structure*/
struct bdx_stats
{
    u64 InUCast;                /* 0x7200 */
    u64 InMCast;                /* 0x7210 */
    u64 InBCast;                /* 0x7220 */
    u64 InPkts;         		/* 0x7230 */
    u64 InErrors;               /* 0x7240 */
    u64 InDropped;              /* 0x7250 */
    u64 FrameTooLong;       	/* 0x7260 */
    u64 FrameSequenceErrors;    /* 0x7270 */
    u64 InVLAN;         		/* 0x7280 */
    u64 InDroppedDFE;       	/* 0x7290 */
    u64 InDroppedIntFull;       /* 0x72A0 */
    u64 InFrameAlignErrors;     /* 0x72B0 */

    /* 0x72C0-0x72E0 RSRV */

    u64 OutUCast;               /* 0x72F0 */
    u64 OutMCast;               /* 0x7300 */
    u64 OutBCast;               /* 0x7310 */
    u64 OutPkts;                /* 0x7320 */

    /* 0x7330-0x7360 RSRV */

    u64 OutVLAN;                /* 0x7370 */
    u64 InUCastOctects;         /* 0x7380 */
    u64 OutUCastOctects;        /* 0x7390 */

    /* 0x73A0-0x73B0 RSRV */

    u64 InBCastOctects;         /* 0x73C0 */
    u64 OutBCastOctects;        /* 0x73D0 */
    u64 InOctects;              /* 0x73E0 */
    u64 OutOctects;             /* 0x73F0 */
};
#define PHY_LEDS				(4)
struct bdx_phy_operations
{
	unsigned short leds[PHY_LEDS];
    int  (*mdio_reset)  (struct bdx_priv *, int, unsigned short);
	u32  (*link_changed)(struct bdx_priv *);
	void (*ledset)      (struct bdx_priv *, enum PHY_LEDS_OP);
	int  (*get_settings)(struct bdx_priv *);
	int  (*set_settings)(struct bdx_priv *, int);

#ifdef _EEE_
    int  (*get_eee)		(struct net_device *, struct ethtool_eee *);
    int  (*set_eee)		(struct bdx_priv *);
    int  (*reset_eee)	(struct bdx_priv *);
#endif
    u32  mdio_speed;
};

//#define TN40_COUNTERS
#ifdef TN40_COUNTERS
typedef struct
{
	u64		tx_pkts;
	u64		tx_bytes;
	u64		tx_fixed_bytes;
	u64		tx_free_pkts;
	u64		tx_free_bytes;
} bdx_counters_t;

#define COUNT_INC(x, counter)		atomic_add_64(&(x.counter), 1)
#define COUNT_ADD(x, counter, n)	atomic_add_64(&(x.counter), n)
#else
#define COUNT_INC(x, counter)
#define COUNT_ADD(x, counter, n)
#endif
struct bdx_priv
{
